# Задача №1: Даны два списка чисел. Найдите все числа, которые входят как в первый, 
# так и во второй список и выведите их в порядке возрастания.
# В одну строку

# my_list = sorted(list(set([int(s) for s in input().split()]) & set([int(s) for s in input().split()])))
# for i in my_list:
#     print(i, end=' ')

################################################

