# Напишите программу, удаляющую из текста все слова содержащие "абв".

# my_text = 'Текабвстовый абвбред Тест генерируетсяабв для рандомабвно программы потомуабвчто прошел этоабв успешно бреабвд'

# def delete_some_words(my_text):
#     my_text = list(filter(lambda x: 'абв' not in x, my_text.split()))
#     return " ".join(my_text)

# my_text = delete_some_words(my_text)
# print(my_text)

##################################################################

